
# State **`s3://infrahouse-github-state/github.state`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |    Destroy |
|:---------:|--------:|-----------:|-----------:|
|     ✅     |       2 |          1 |          0 |
## Affected resources by action

|  Action  | Resources                                                           |
|:--------:|:--------------------------------------------------------------------|
|    🟢     | `module.repos["infrahouse-aws-control"].github_repository.repo`     |
|    🟢     | `module.repos["infrahouse-aws-control"].github_team_repository.dev` |
|    🟢     | `github_membership.infrahouse["akuzminsky"]:`                       |
|    🟡     | `module.ih_8_repos["github-control"].github_repository.repo`        |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/b1302485-e252-492a-83bf-521807decfd4/terraform-bin plan -var-file=configuration.tfvars --out=tf.plan
github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]
github_organization_settings.infrahouse: Refreshing state... [id=121984263]
github_team.dev: Refreshing state... [id=7332815]
module.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]
github_team_members.dev: Refreshing state... [id=7332815]
module.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]
module.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]
github_repository.terraform-template: Refreshing state... [id=terraform-template]
module.ih_8_repos["aws-s3-control"].github_repository.repo: Refreshing state... [id=aws-s3-control]
module.ih_8_repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]
module.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]
module.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]
module.ih_8_repos["github-control"].github_actions_secret.role[0]: Refreshing state... [id=github-control:AWS_ROLE]
module.ih_8_repos["aws-s3-control"].github_actions_secret.role[0]: Refreshing state... [id=aws-s3-control:AWS_ROLE]
module.ih_8_repos["aws-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-control:akuzminsky]
module.ih_8_repos["aws-s3-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-s3-control:akuzminsky]
module.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]
module.ih_8_repos["aws-control"].github_branch_default.main: Refreshing state... [id=aws-control]
module.ih_8_repos["aws-s3-control"].github_branch_default.main: Refreshing state... [id=aws-s3-control]
module.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]
module.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]
module.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]
aws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]
module.ih_8_repos["aws-s3-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCeiUc4CEZvQ]
module.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]
module.ih_8_repos["aws-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCxf584CEeam]
data.aws_secretsmanager_secret_version.pypi_api_token: Reading...
data.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]
github_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.ih_8_repos["github-control"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "github-control"
        name                        = "github-control"
        # (33 unchanged attributes hidden)

      + template {
          + include_all_branches = false
          + owner                = "infrahouse8"
          + repository           = "terraform-template"
        }

        # (1 unchanged block hidden)
    }

  # module.repos["infrahouse-aws-control"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "InfraHouse AWS Infrastructure"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "infrahouse-aws-control"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
    }

  # module.repos["infrahouse-aws-control"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "infrahouse-aws-control"
      + team_id    = "7332815"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Agithub_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Agithub_team.dev: Refreshing state... [id=7332815]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Amodule.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]%0Agithub_repository.terraform-template: Refreshing state... [id=terraform-template]%0Amodule.ih_8_repos["aws-s3-control"].github_repository.repo: Refreshing state... [id=aws-s3-control]%0Amodule.ih_8_repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]%0Amodule.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]%0Amodule.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]%0Amodule.ih_8_repos["github-control"].github_actions_secret.role[0]: Refreshing state... [id=github-control:AWS_ROLE]%0Amodule.ih_8_repos["aws-s3-control"].github_actions_secret.role[0]: Refreshing state... [id=aws-s3-control:AWS_ROLE]%0Amodule.ih_8_repos["aws-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-control:akuzminsky]%0Amodule.ih_8_repos["aws-s3-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-s3-control:akuzminsky]%0Amodule.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]%0Amodule.ih_8_repos["aws-control"].github_branch_default.main: Refreshing state... [id=aws-control]%0Amodule.ih_8_repos["aws-s3-control"].github_branch_default.main: Refreshing state... [id=aws-s3-control]%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0Amodule.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]%0Amodule.ih_8_repos["aws-s3-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCeiUc4CEZvQ]%0Amodule.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]%0Amodule.ih_8_repos["aws-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCxf584CEeam]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]%0Agithub_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.ih_8_repos["github-control"].github_repository.repo will be updated in-place%0A  ~ resource "github_repository" "repo" {%0A        id                          = "github-control"%0A        name                        = "github-control"%0A        # (33 unchanged attributes hidden)%0A%0A      + template {%0A          + include_all_branches = false%0A          + owner                = "infrahouse8"%0A          + repository           = "terraform-template"%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.repos["infrahouse-aws-control"].github_repository.repo will be created%0A  + resource "github_repository" "repo" {%0A      + allow_auto_merge            = false%0A      + allow_merge_commit          = true%0A      + allow_rebase_merge          = true%0A      + allow_squash_merge          = true%0A      + archived                    = false%0A      + default_branch              = (known after apply)%0A      + delete_branch_on_merge      = false%0A      + description                 = "InfraHouse AWS Infrastructure"%0A      + etag                        = (known after apply)%0A      + full_name                   = (known after apply)%0A      + git_clone_url               = (known after apply)%0A      + has_issues                  = true%0A      + html_url                    = (known after apply)%0A      + http_clone_url              = (known after apply)%0A      + id                          = (known after apply)%0A      + merge_commit_message        = "PR_TITLE"%0A      + merge_commit_title          = "MERGE_MESSAGE"%0A      + name                        = "infrahouse-aws-control"%0A      + node_id                     = (known after apply)%0A      + private                     = (known after apply)%0A      + repo_id                     = (known after apply)%0A      + squash_merge_commit_message = "COMMIT_MESSAGES"%0A      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"%0A      + ssh_clone_url               = (known after apply)%0A      + svn_url                     = (known after apply)%0A      + visibility                  = "public"%0A    }%0A%0A  # module.repos["infrahouse-aws-control"].github_team_repository.dev will be created%0A  + resource "github_team_repository" "dev" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "push"%0A      + repository = "infrahouse-aws-control"%0A      + team_id    = "7332815"%0A    }%0A%0APlan: 2 to add, 1 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLXN0YXRlL2dpdGh1Yi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiW2NvbW1hbmRdL2hvbWUvcnVubmVyL3dvcmsvX3RlbXAvYjEzMDI0ODUtZTI1Mi00OTJhLTgzYmYtNTIxODA3ZGVjZmQ0L3RlcnJhZm9ybS1iaW4gcGxhbiAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLS1vdXQ9dGYucGxhblxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX21lbWJlcnNoaXAuaW5mcmFob3VzZVtcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2U6YWt1em1pbnNreV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9vcmdhbml6YXRpb25fc2V0dGluZ3MuaW5mcmFob3VzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MTIxOTg0MjYzXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3RlYW0uZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl90ZWFtX21lbWJlcnMuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfcmVwb3NpdG9yeS50ZXJyYWZvcm0tdGVtcGxhdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS10ZW1wbGF0ZV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnlfY29sbGFib3JhdG9yLmNvbGxhYm9yYXRvcnNbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpha3V6bWluc2t5XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQucm9sZVswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6QVdTX1JPTEVdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5yb2xlWzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbDpBV1NfUk9MRV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnlfY29sbGFib3JhdG9yLmNvbGxhYm9yYXRvcnNbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpha3V6bWluc2t5XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeV9jb2xsYWJvcmF0b3IuY29sbGFib3JhdG9yc1tcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sOmFrdXptaW5za3ldXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYnJhbmNoX2RlZmF1bHQubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS10b29sa2l0XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LnB5cGlfYXBpX3Rva2VuOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tZGhJSTlQXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9KQ2VpVWM0Q0VadlFdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0kydnU3TTRDQWljaV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9wcm90ZWN0aW9uLm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUJQUl9rd0RPSkN4ZjU4NENFZWFtXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tZGhJSTlQfEFXU0NVUlJFTlRdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfYWN0aW9uc19zZWNyZXQucHlwaV9hcGlfdG9rZW5bXCJpbmZyYWhvdXNlLXRvb2xraXRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpQWVBJX0FQSV9UT0tFTl1cdTAwMWJbMG1cblxuVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvblxucGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOlxuICBcdTAwMWJbMzJtK1x1MDAxYlswbSBjcmVhdGVcdTAwMWJbMG1cbiAgXHUwMDFiWzMzbX5cdTAwMWJbMG0gdXBkYXRlIGluLXBsYWNlXHUwMDFiWzBtXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvXHUwMDFiWzBtIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuXHUwMDFiWzBtICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImdpdGh1Yi1jb250cm9sXCJcbiAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJnaXRodWItY29udHJvbFwiXG4gICAgICAgIFx1MDAxYls5MG0jICgzMyB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtXG5cbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHRlbXBsYXRlIHtcbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpbmNsdWRlX2FsbF9icmFuY2hlcyA9IGZhbHNlXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gb3duZXIgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2U4XCJcbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXBvc2l0b3J5ICAgICAgICAgICA9IFwidGVycmFmb3JtLXRlbXBsYXRlXCJcbiAgICAgICAgfVxuXG4gICAgICAgIFx1MDAxYls5MG0jICgxIHVuY2hhbmdlZCBibG9jayBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFxuXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYWxsb3dfYXV0b19tZXJnZSAgICAgICAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFsbG93X21lcmdlX2NvbW1pdCAgICAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFsbG93X3JlYmFzZV9tZXJnZSAgICAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFsbG93X3NxdWFzaF9tZXJnZSAgICAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFyY2hpdmVkICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBkZWZhdWx0X2JyYW5jaCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBkZWxldGVfYnJhbmNoX29uX21lcmdlICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gZGVzY3JpcHRpb24gICAgICAgICAgICAgICAgID0gXCJJbmZyYUhvdXNlIEFXUyBJbmZyYXN0cnVjdHVyZVwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBldGFnICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBmdWxsX25hbWUgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBnaXRfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBoYXNfaXNzdWVzICAgICAgICAgICAgICAgICAgPSB0cnVlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBodG1sX3VybCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBodHRwX2Nsb25lX3VybCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBtZXJnZV9jb21taXRfbWVzc2FnZSAgICAgICAgPSBcIlBSX1RJVExFXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIG1lcmdlX2NvbW1pdF90aXRsZSAgICAgICAgICA9IFwiTUVSR0VfTUVTU0FHRVwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gbm9kZV9pZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcHJpdmF0ZSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb19pZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc3F1YXNoX21lcmdlX2NvbW1pdF9tZXNzYWdlID0gXCJDT01NSVRfTUVTU0FHRVNcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc3F1YXNoX21lcmdlX2NvbW1pdF90aXRsZSAgID0gXCJDT01NSVRfT1JfUFJfVElUTEVcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc3NoX2Nsb25lX3VybCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc3ZuX3VybCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdmlzaWJpbGl0eSAgICAgICAgICAgICAgICAgID0gXCJwdWJsaWNcIlxuICAgIH1cblxuXHUwMDFiWzFtICAjIG1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXZcdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX3RlYW1fcmVwb3NpdG9yeVwiIFwiZGV2XCIge1xuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gZXRhZyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwZXJtaXNzaW9uID0gXCJwdXNoXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlcG9zaXRvcnkgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdGVhbV9pZCAgICA9IFwiNzMzMjgxNVwiXG4gICAgfVxuXG5cdTAwMWJbMW1QbGFuOlx1MDAxYlswbSAyIHRvIGFkZCwgMSB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS5cblx1MDAxYlswbVx1MDAxYls5MG1cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MDAxYlswbVxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IFx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9tZW1iZXJzaGlwLmluZnJhaG91c2VbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlOmFrdXptaW5za3ldXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX29yZ2FuaXphdGlvbl9zZXR0aW5ncy5pbmZyYWhvdXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0xMjE5ODQyNjNdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3RlYW0uZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3RlYW1fbWVtYmVycy5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9yZXBvc2l0b3J5LnRlcnJhZm9ybS10ZW1wbGF0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnlfY29sbGFib3JhdG9yLmNvbGxhYm9yYXRvcnNbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpha3V6bWluc2t5XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnJvbGVbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOkFXU19ST0xFXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnJvbGVbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sOkFXU19ST0xFXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnlfY29sbGFib3JhdG9yLmNvbGxhYm9yYXRvcnNbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpha3V6bWluc2t5XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnlfY29sbGFib3JhdG9yLmNvbGxhYm9yYXRvcnNbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbDpha3V6bWluc2t5XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXRvb2xraXRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucHlwaV9hcGlfdG9rZW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi1kaElJOVBdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9KQ2VpVWM0Q0VadlFdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9JMnZ1N000Q0FpY2ldXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9KQ3hmNTg0Q0VlYW1dXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UHxBV1NDVVJSRU5UXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9hY3Rpb25zX3NlY3JldC5weXBpX2FwaV90b2tlbltcImluZnJhaG91c2UtdG9vbGtpdFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OlBZUElfQVBJX1RPS0VOXVx1MDAxYlswbSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICBcdTAwMWJbMzJtK1x1MDAxYlswbSBjcmVhdGVcdTAwMWJbMG0lMEEgIFx1MDAxYlszM21+XHUwMDFiWzBtIHVwZGF0ZSBpbi1wbGFjZVx1MDAxYlswbSUwQSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG9cdTAwMWJbMG0gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlJTBBXHUwMDFiWzBtICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIgeyUwQSAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJnaXRodWItY29udHJvbFwiJTBBICAgICAgICBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgPSBcImdpdGh1Yi1jb250cm9sXCIlMEEgICAgICAgIFx1MDAxYls5MG0jICgzMyB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtJTBBJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdGVtcGxhdGUgeyUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpbmNsdWRlX2FsbF9icmFuY2hlcyA9IGZhbHNlJTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIG93bmVyICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlOFwiJTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlcG9zaXRvcnkgICAgICAgICAgID0gXCJ0ZXJyYWZvcm0tdGVtcGxhdGVcIiUwQSAgICAgICAgfSUwQSUwQSAgICAgICAgXHUwMDFiWzkwbSMgKDEgdW5jaGFuZ2VkIGJsb2NrIGhpZGRlbilcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG9cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkJTBBXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIgeyUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFsbG93X2F1dG9fbWVyZ2UgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYWxsb3dfbWVyZ2VfY29tbWl0ICAgICAgICAgID0gdHJ1ZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFsbG93X3JlYmFzZV9tZXJnZSAgICAgICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBhbGxvd19zcXVhc2hfbWVyZ2UgICAgICAgICAgPSB0cnVlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYXJjaGl2ZWQgICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBkZWZhdWx0X2JyYW5jaCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gZGVsZXRlX2JyYW5jaF9vbl9tZXJnZSAgICAgID0gZmFsc2UlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBkZXNjcmlwdGlvbiAgICAgICAgICAgICAgICAgPSBcIkluZnJhSG91c2UgQVdTIEluZnJhc3RydWN0dXJlXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBldGFnICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gZnVsbF9uYW1lICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGdpdF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBoYXNfaXNzdWVzICAgICAgICAgICAgICAgICAgPSB0cnVlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaHRtbF91cmwgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGh0dHBfY2xvbmVfdXJsICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gbWVyZ2VfY29tbWl0X21lc3NhZ2UgICAgICAgID0gXCJQUl9USVRMRVwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gbWVyZ2VfY29tbWl0X3RpdGxlICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIG5vZGVfaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwcml2YXRlICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb19pZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHNxdWFzaF9tZXJnZV9jb21taXRfbWVzc2FnZSA9IFwiQ09NTUlUX01FU1NBR0VTXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzcXVhc2hfbWVyZ2VfY29tbWl0X3RpdGxlICAgPSBcIkNPTU1JVF9PUl9QUl9USVRMRVwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc3NoX2Nsb25lX3VybCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHN2bl91cmwgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB2aXNpYmlsaXR5ICAgICAgICAgICAgICAgICAgPSBcInB1YmxpY1wiJTBBICAgIH0lMEElMEFcdTAwMWJbMW0gICMgbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldlx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWQlMEFcdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX3RlYW1fcmVwb3NpdG9yeVwiIFwiZGV2XCIgeyUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGV0YWcgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwZXJtaXNzaW9uID0gXCJwdXNoXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXBvc2l0b3J5ID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB0ZWFtX2lkICAgID0gXCI3MzMyODE1XCIlMEEgICAgfSUwQSUwQVx1MDAxYlsxbVBsYW46XHUwMDFiWzBtIDIgdG8gYWRkLCAxIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LiUwQVx1MDAxYlswbVx1MDAxYls5MG0lMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTAwMWJbMG0lMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMFxuIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogMiwgImNoYW5nZSI6IDEsICJkZXN0cm95IjogMH19```
</p></details>